# StairsRailingHeightShiftVal Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRailingHeightShiftVal Property
ParameterTypeId Class See Also
---
"Landing Height Adjustment"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRailingHeightShiftVal { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRailingHeightShiftVal As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRailingHeightShiftVal {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace